import { CommonModule } from '@angular/common';
import { Component, Input } from '@angular/core';

@Component({
  selector: 'app-preinvoice-footer',
  standalone: true,
  imports: [CommonModule],
  templateUrl: './preinvoice-footer.component.html',
  styleUrl: './preinvoice-footer.component.css',
})
export class PreinvoiceFooterComponent {
  @Input() includePersonalBank = false;

  readonly personalPaymentLine =
    'بانک ملی به نام مهدی آذرآئین، شماره حساب 0104314355004، شماره شبا IR400170000000104314355004، شماره کارت 6037-9975-5468-9316';

  readonly companyPaymentLines = [
    'بانک ملی به نام شرکت ابزار دقیق زنگان 0227555630005، شماره شبا IR440170000000227555630005، شماره كارت 2009-0008-9988-6037',
    'بانک کارآفرین به نام شرکت ابزار دقیق زنگان، شماره حساب 03202594329600، شماره شبا IR710530000003202594329600، شماره کارت 6274-8888-0000-9767',
  ];

  readonly terms = [
    'پس از واریز، تصویر برگه پرداخت را به واحد مالی شرکت ارسال فرمایید.',
    'جهت صدور فاکتور رسمی و ثبت در سامانه مودیان، مشخصات حقوقی را ارسال فرمایید.',
    'کلیه موارد فوق مربوط به خدمات کالیبراسیون می باشد و در زمان انجام فرآیند كالیبراسیون حضور مسئول فنی یا كنترل كیفیت و یا جانشین ایشان الزامی است.',
    'هزینه حمل تجهیزات به عهده کارفرما بوده و ارسال وزنه مرجع برای كالیبراسیون باسكول تا 500 كیلوگرم به عهده این شركت می باشد.',
    'تحویل تجهیزات كالیبره شده در محل آزمایشگاه كالیبراسیون بوده و ترجیحاً مسئول فنی شركت نسبت به تحویل اقدام نماید. ارسال تجهیزات به آدرس مشتری به صورت پسكرایه بوده و بنا به درخواست كتبی صورت می گیرد.',
    'تجهیزات خارج از دامنه كاری به آزمایشگاه همكار دارای صلاحیت ارسال می شود.',
    'هزینه های اعلامی بنابر لیست ارسال شده می باشد. درصورت کاهش تعداد دستگاه ها مبلغ قابل پرداخت بر تعداد تجهیزات تقسیم خواهد شد.',
    'در صورت انجام فعالیت كالیبراسیون و مردود بودن تجهیز، و یا خارج از کالیبره بودن تجهیز، هزینه ی كالیبراسیون محاسبه می گردد.',
    'در صورت نیاز هزینه اسكان كارشناسان به عهده ی كارفرما می باشد.',
    'هزینه اعلامی برای محیط دمایی در 1 نقطه دمایی می باشد، درصورت افزایش تعداد نقاط دمایی هزینه اضافی لحاظ خواهد شد.',
  ];
}
